import pulp

# Визначення задачі
задача = pulp.LpProblem("Оптимізація_виробництва_напоїв", pulp.LpMaximize)

# Змінні рішення
лимонад = pulp.LpVariable('Лимонад', lowBound=0, cat='Continuous')
фруктовий_сік = pulp.LpVariable('Фруктовий_сік', lowBound=0, cat='Continuous')

# Цільова функція: Максимізувати загальне виробництво
задача += лимонад + фруктовий_сік, "Загальне_виробництво"

# Обмеження
задача += 2*лимонад + 1*фруктовий_сік <= 100, "Обмеження_води"
задача += 1*лимонад <= 50, "Обмеження_цукру"
задача += 1*лимонад <= 30, "Обмеження_лимонного_соку"
задача += 2*фруктовий_сік <= 40, "Обмеження_фруктового_пюре"

# Розв'язання задачі
задача.solve()

# Відображення результатів
print("Статус:", pulp.LpStatus[задача.status])
print("Кількість виробленого лимонаду:", pulp.value(лимонад))
print("Кількість виробленого фруктового соку:", pulp.value(фруктовий_сік))
